/* Работает только для м-цы 3x3
Посчитаь определитель матрицы методом треугольника
1 2 3
4 5 6
7 8 9

Определитель: 1*5*9 + 2*6*7 + 3*4*8 - 3*5*7 - 1*6*8 - 2*4*9 = 45 + 84 + 96 - 105 - 48 - 72 = 0
*/
#include <stdio.h>
#define N 3
#define M 3

int A[N][M];

int func(int A[N][M])
{
	return (A[0][0] * A[1][1] * A[2][2]) + (A[1][0] * A[2][1] * A[0][2]) + 
	(A[2][0] * A[0][1] * A[1][2]) - (A[2][0] * A[1][1] * A[0][2]) - 
	(A[0][0] * A[2][1] * A[1][2]) - (A[1][0] * A[0][1] * A[2][2]);
}

int main() 
{
	int i, j;
	for (i = 0; i < N; i++)
	{
		for (j = 0; j < M; j++)
		{
			scanf("%d", &A[i][j]);
		}
	}

	int Answer = func(A);
	printf("\n%d", Answer);
	
	return 0;
}